Autodesk.Revit.DB.GBXMLExportOptions.ExportEnergyModelType
The energy model type from which gbXML will be exported.
Remarks:
Default value is AnalysisMode.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015